<?xml version="1.0" ?>
<net name="SynthesisNetwork" version="10">
	<layers>
		<layer id="0" name="style" type="Parameter" version="opset1">
			<data shape="1, 512" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="style">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="m.layers.4.to_img.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="0" size="524288"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.to_img.conv.modulation.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gemm_306/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="m.layers.4.to_img.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="524288" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.to_img.conv.modulation.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gemm_306" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="959">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1337" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1337">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_307" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="969">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_308" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="525344" size="4"/>
			<output>
				<port id="0" precision="FP32" names="970">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Mul_309" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="971">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="m.layers.4.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="525348" size="524288"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv2.conv.modulation.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Gemm_287/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="m.layers.4.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="1049636" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Gemm_287" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="913">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1320" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1320">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_288" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="923">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_289" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1050660" size="4"/>
			<output>
				<port id="0" precision="FP32" names="924">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Mul_290" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="925">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="m.layers.4.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="1050664" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Gemm_268/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="m.layers.4.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="1312808" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Gemm_268" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="867">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="1303" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1303">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_269" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="877">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_270" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1313320" size="4"/>
			<output>
				<port id="0" precision="FP32" names="878">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Mul_271" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="879">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="m.layers.4.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="1313324" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Gemm_249/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="m.layers.4.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="2361900" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Gemm_249" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="812">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="1280" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1280">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_250" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="821">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="m.layers.3.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="2363948" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv2.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Gemm_230/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="m.layers.3.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="3412524" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Gemm_230" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="763">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="1263" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1263">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_231" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="773">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_232" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="3414572" size="4"/>
			<output>
				<port id="0" precision="FP32" names="774">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Mul_233" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="775">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="m.layers.3.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="3414576" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Gemm_211/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="m.layers.3.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="3676720" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Gemm_211" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="717">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="1246" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1246">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_212" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="727">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1313320" size="4"/>
			<output>
				<port id="0" precision="FP32" names="728">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Mul_214" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="729">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="m.layers.3.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="3677232" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Gemm_192/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="m.layers.3.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="4725808" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Gemm_192" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="662">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="1223" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1223">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_193" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="671">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="m.layers.2.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="4727856" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.conv2.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Gemm_173/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="m.layers.2.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="5776432" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Gemm_173" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="613">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1206" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1206">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_174" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="623">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_175" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="3414572" size="4"/>
			<output>
				<port id="0" precision="FP32" names="624">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Mul_176" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="625">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="m.layers.2.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="5778480" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Gemm_154/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="m.layers.2.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="6040624" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Gemm_154" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="567">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1189" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1189">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_155" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="577">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_156" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1313320" size="4"/>
			<output>
				<port id="0" precision="FP32" names="578">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Mul_157" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="579">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="m.layers.2.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="6041136" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Gemm_135/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="m.layers.2.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="7089712" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.2.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Gemm_135" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="512">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="1166" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1166">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_136" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="521">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="m.layers.1.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="7091760" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.conv2.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Gemm_116/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="m.layers.1.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="8140336" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Gemm_116" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="463">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="1149" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1149">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_117" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="473">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_118" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="3414572" size="4"/>
			<output>
				<port id="0" precision="FP32" names="474">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul_119" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="475">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="m.layers.1.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="8142384" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Gemm_97/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="m.layers.1.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="8404528" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Gemm_97" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="417">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="1132" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1132">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_98" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="427">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_99" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1313320" size="4"/>
			<output>
				<port id="0" precision="FP32" names="428">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Mul_100" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="429">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="m.layers.1.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="8405040" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Gemm_78/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="m.layers.1.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="9453616" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.1.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Gemm_78" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="362">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1109" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1109">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_79" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="371">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="m.layers.0.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="9455664" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.conv2.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Gemm_59/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="m.layers.0.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="10504240" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Gemm_59" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="313">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="1092" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1092">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape_60" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="323">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_61" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="3414572" size="4"/>
			<output>
				<port id="0" precision="FP32" names="324">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Mul_62" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="325">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="m.layers.0.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="10506288" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Gemm_40/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="m.layers.0.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="10768432" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Gemm_40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="267">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="1075" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1075">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Reshape_41" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="277">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_42" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1313320" size="4"/>
			<output>
				<port id="0" precision="FP32" names="278">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Mul_43" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="279">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="m.layers.0.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="10768944" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Gemm_21/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="m.layers.0.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="11817520" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.0.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Gemm_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="1052" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1052">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape_22" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="221">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="m.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="11819568" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.conv1.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Gemm_3/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="m.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="12868144" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Gemm_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="166">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="1037" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="525312" size="32"/>
			<output>
				<port id="0" precision="I64" names="1037">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="176">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_5" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="3414572" size="4"/>
			<output>
				<port id="0" precision="FP32" names="177">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Mul_6" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="178">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Tile_2" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 4, 4" offset="12870192" size="32768"/>
			<output>
				<port id="0" precision="FP32" names="165">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Mul_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="179">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Mul_17_copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="12902960" size="9437184"/>
			<output>
				<port id="0" precision="FP32" names="m.conv1.conv.weight">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Conv_8" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="1047" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4, 4" offset="22340144" size="64"/>
			<output>
