<?xml version="1.0" ?>
<net name="SynthesisNetwork" version="10">
	<layers>
		<layer id="0" name="style" type="Parameter" version="opset1">
			<data shape="1, 512" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="style">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="m.layers.6.to_img.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 512" offset="0" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.to_img.conv.modulation.weight">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gemm_743/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="m.layers.6.to_img.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64" offset="131072" size="256"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.to_img.conv.modulation.bias">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gemm_743" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1445">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Shape_744" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1446">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_745" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1447"/>
			</output>
		</layer>
		<layer id="7" name="Gather_746/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="8" name="Gather_7461546" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1448"/>
			</output>
		</layer>
		<layer id="9" name="Unsqueeze_747/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Unsqueeze_747/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1452">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="1819" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1819">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="1820" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1820">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1821" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1821">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Concat_748" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1456">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_749" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1457">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_750" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="131356" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1458">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Mul_751" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1459">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="m.layers.6.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 512" offset="131360" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.conv2.conv.modulation.weight">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Gemm_710/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="m.layers.6.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64" offset="262432" size="256"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Gemm_710" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1393">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Shape_711" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1394">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_712" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1395"/>
			</output>
		</layer>
		<layer id="24" name="Gather_713/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="25" name="Gather_7131498" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1396"/>
			</output>
		</layer>
		<layer id="26" name="Unsqueeze_714/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Unsqueeze_714/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1400">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="1807" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1807">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="1808" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1808">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="1809" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1809">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Concat_715" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1404">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_716" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1405">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_717" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="262688" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1406">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Mul_718" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1407">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="m.layers.6.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 512" offset="262692" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.conv1.conv.modulation.weight">
					<dim>32</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Gemm_677/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="m.layers.6.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32" offset="328228" size="128"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Gemm_677" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1341">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Shape_678" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1342">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_679" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1343"/>
			</output>
		</layer>
		<layer id="41" name="Gather_680/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="42" name="Gather_6801458" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1344"/>
			</output>
		</layer>
		<layer id="43" name="Unsqueeze_681/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Unsqueeze_681/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1348">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="1795" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1795">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="1796" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1796">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="1797" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1797">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Concat_682" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1352">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_683" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1353">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_684" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="328356" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1354">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Mul_685" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1355">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="m.layers.6.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="328360" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.up.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Gemm_652/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="m.layers.6.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="590504" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.6.up.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Gemm_652" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1286">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="m.layers.5.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="591016" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.conv2.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Gemm_610/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="m.layers.5.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="853160" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Gemm_610" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1225">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Shape_611" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1226">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_612" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1227"/>
			</output>
		</layer>
		<layer id="62" name="Gather_613/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="63" name="Gather_6131508" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1228"/>
			</output>
		</layer>
		<layer id="64" name="Unsqueeze_614/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Unsqueeze_614/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1232">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1766" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1766">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1767" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1767">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1768" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1768">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Concat_615" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1236">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_616" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1237">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_617" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="853672" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1238">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Mul_618" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1239">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="m.layers.5.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 512" offset="853676" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.conv1.conv.modulation.weight">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Gemm_577/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="m.layers.5.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64" offset="984748" size="256"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Gemm_577" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1173">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Shape_578" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1174">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_579" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1175"/>
			</output>
		</layer>
		<layer id="79" name="Gather_580/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="80" name="Gather_5801492" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1176"/>
			</output>
		</layer>
		<layer id="81" name="Unsqueeze_581/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Unsqueeze_581/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1180">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="1754" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1754">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1755" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1755">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="1756" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1756">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_582" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1184">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_583" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1185">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_584" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="262688" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1186">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Mul_585" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1187">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="m.layers.5.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="985004" size="524288"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.up.modulation.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Gemm_552/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="m.layers.5.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="1509292" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.5.up.modulation.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Gemm_552" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1118">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="m.layers.4.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="1510316" size="524288"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv2.conv.modulation.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Gemm_510/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="m.layers.4.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="2034604" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Gemm_510" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1057">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Shape_511" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1058">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_512" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1059"/>
			</output>
		</layer>
		<layer id="100" name="Gather_513/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="Gather_5131540" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1060"/>
			</output>
		</layer>
		<layer id="102" name="Unsqueeze_514/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Unsqueeze_514/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1064">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="1725" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1725">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="1726" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1726">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="1727" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1727">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Concat_515" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1068">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_516" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1069">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_517" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2035628" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1070">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Mul_518" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1071">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="m.layers.4.conv1.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512" offset="2035632" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv1.conv.modulation.weight">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Gemm_477/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="m.layers.4.conv1.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="2297776" size="512"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.conv1.conv.modulation.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Gemm_477" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1005">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Shape_478" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1006">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_479" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="1007"/>
			</output>
		</layer>
		<layer id="117" name="Gather_480/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="118" name="Gather_4801550" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="1008"/>
			</output>
		</layer>
		<layer id="119" name="Unsqueeze_481/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Unsqueeze_481/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1012">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="1713" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1713">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="1714" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1714">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="1715" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1715">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Concat_482" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="1016">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Reshape_483" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1017">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_484" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="853672" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1018">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Mul_485" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1019">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="m.layers.4.up.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="2298288" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.up.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Gemm_452/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="m.layers.4.up.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="3346864" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.4.up.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Gemm_452" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="950">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="m.layers.3.conv2.conv.modulation.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="3348912" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv2.conv.modulation.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Gemm_410/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="m.layers.3.conv2.conv.modulation.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="4397488" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="m.layers.3.conv2.conv.modulation.bias">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Gemm_410" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="889">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Shape_411" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="890">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Constant_412" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="131328" size="4"/>
			<output>
				<port id="0" precision="I32" names="891"/>
			</output>
		</layer>
		<layer id="138" name="Gather_413/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="139" name="Gather_4131522" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="892"/>
			</output>
		</layer>
		<layer id="140" name="Unsqueeze_414/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131332" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Unsqueeze_414/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="896">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="1684" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131340" size="8"/>
			<output>
				<port id="0" precision="I64" names="1684">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="1685" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1685">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="1686" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="131348" size="8"/>
			<output>
				<port id="0" precision="I64" names="1686">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="Concat_415" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="900">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="Reshape_416" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="901">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="Constant_417" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4399536" size="4"/>
			<output>
				<port id="0" precision="FP32" names="902">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="Mul_418" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="903">
					<dim>1</dim>
